In [ ]:
###################### DataFrame ##########

In [1]:
import pandas as pd

#데이터프레임 만들기
df = pd.DataFrame({ # 딕셔너리 형태로 들어와야함
    "미국" : [2.1,2.2,2.3],
    "한국" : [0.4,0.4,0.45],
    "중국" : [10,13,15]
})
df

    미국    한국  중국
0  2.1  0.40  10
1  2.2  0.40  13
2  2.3  0.45  15

In [3]:
import pandas as pd

#데이터프레임 만들기
df = pd.DataFrame({ # 딕셔너리 형태로 들어와야함
    "미국" : [2.1,2.2,2.3],
    "한국" : [0.4,0.4,0.45],
    "중국" : [10,13,15]
},index=[2000,2010,2020])
df

       미국    한국  중국
2000  2.1  0.40  10
2010  2.2  0.40  13
2020  2.3  0.45  15

In [4]:
df.index=[2001,2002,2003]

In [5]:
df

       미국    한국  중국
2001  2.1  0.40  10
2002  2.2  0.40  13
2003  2.3  0.45  15

In [7]:
#컬럼즈(미국,한국, 중국 ) 찾아오기
df.columns

Index(['미국', '한국', '중국'], dtype='object')

In [8]:
# 컬럼즈값 바꾸기
df.columns = ["일본","필리핀","러시아"]
df

       일본   필리핀  러시아
2001  2.1  0.40   10
2002  2.2  0.40   13
2003  2.3  0.45   15

In [9]:
df.values # 중첩되어진 리스트의 형태를 가지고 있음.

array([[ 2.1 ,  0.4 , 10.  ],
       [ 2.2 ,  0.4 , 13.  ],
       [ 2.3 ,  0.45, 15.  ]])

In [ ]:
# 특정열을 인덱스로 바꿔줄 수 있는가 없는가?

In [11]:
df = pd.DataFrame({ 
    "년도" : [2000,2010,2020],
    "미국" : [2.1,2.2,2.3],
    "한국" : [0.4,0.4,0.45],
    "중국" : [10,13,15]
})
df

     년도   미국    한국  중국
0  2000  2.1  0.40  10
1  2010  2.2  0.40  13
2  2020  2.3  0.45  15

In [21]:
df = df.set_index("년도") # set_index : 인덱스를 줄 값들을 정할 수 있음! 이때 원래있던 요소를 적용!
df

       미국    한국  중국
년도
2000  2.1  0.40  10
2010  2.2  0.40  13
2020  2.3  0.45  15

In [20]:
# 인덱스 키 교체 -> reset 하고 다시 설정하면 됨!
df = df.reset_index("년도")
df

     년도   미국    한국  중국
0  2000  2.1  0.40  10
1  2010  2.2  0.40  13
2  2020  2.3  0.45  15

In [24]:
df.index.name

'연도'

In [23]:
df.index.name = "연도"

In [27]:
df = df.set_index("연도")
df

       미국    한국  중국
연도
2000  2.1  0.40  10
2010  2.2  0.40  13
2020  2.3  0.45  15

In [28]:
df.loc[2000] # loc 인덱스 키 값의 위치로 밸류값을 찾아옴. 
#실제 인덱스 명을 활용해서 해당 인덱스에 해당하는 값 = 행(record) 값을 찾아올 때 사용

미국     2.1
한국     0.4
중국    10.0
Name: 2000, dtype: float64

In [29]:
df.iloc[0] # iloc 인덱스의 숫자값을 위치로 밸류값들을 찾아옴! 
#인덱스의 연번 = 순번을 기준으로 record의 값을 찾아올 때 사용

미국     2.1
한국     0.4
중국    10.0
Name: 2000, dtype: float64

In [30]:
type(df.loc[2000]) # 행도 series로 인식함! [] 행이든 열이든 리스트로 값을 가져옴

pandas.core.series.Series

In [31]:
df["미국"] # 연도(인덱스값)를 기준으로 미국에 관련된 행을 찾아옴!

연도
2000    2.1
2010    2.2
2020    2.3
Name: 미국, dtype: float64

In [32]:
type(df["미국"])

pandas.core.series.Series

In [34]:
print(df["미국"][2010])

2.2

In [36]:
print(df.loc[2010]["미국"]) #열이든 행이든 똑같은 값을 크로스해서 찾아올 수 있음!

2.2

In [37]:
df = pd.DataFrame({ 
    "년도" : ["2000","2010","2020"],
    "미국" : [2.1,2.2,2.3],
    "한국" : [0.4,0.4,0.45],
    "중국" : [10,13,15]
})
df # 년도를 문자열로 넣어도 똑같은 값처럼 보임

     년도   미국    한국  중국
0  2000  2.1  0.40  10
1  2010  2.2  0.40  13
2  2020  2.3  0.45  15

In [39]:
df = df.set_index("년도")

In [40]:
df

       미국    한국  중국
년도
2000  2.1  0.40  10
2010  2.2  0.40  13
2020  2.3  0.45  15

In [41]:
 df.index # 년도가 문자열이기 때문에 타입이 object로 나옴

Index(['2000', '2010', '2020'], dtype='object', name='년도')

In [43]:
df.loc["2000"]

미국     2.1
한국     0.4
중국    10.0
Name: 2000, dtype: float64

In [44]:
df["일본"] = [1,2,3]

In [45]:
df

       미국    한국  중국  일본
년도
2000  2.1  0.40  10   1
2010  2.2  0.40  13   2
2020  2.3  0.45  15   3

In [46]:
del df["일본"]

In [47]:
df

       미국    한국  중국
년도
2000  2.1  0.40  10
2010  2.2  0.40  13
2020  2.3  0.45  15

In [48]:
df.loc[2021] = [1,2,3]
df

       미국    한국  중국
년도
2000  2.1  0.40  10
2010  2.2  0.40  13
2020  2.3  0.45  15
2021  1.0  2.00   3

In [49]:
df.drop([2021])

       미국    한국  중국
년도
2000  2.1  0.40  10
2010  2.2  0.40  13
2020  2.3  0.45  15

In [54]:
df # 위 셀에서 드랍을 해도 안사라짐 -> drop은 '임시삭제'이기 때문에!! inplace=True를 넣으면 원본도 바뀜

       미국    한국  중국
년도
2000  2.1  0.40  10
2010  2.2  0.40  13
2020  2.3  0.45  15
2021  1.0  2.00   3

In [58]:
df.drop([2021],inplace=True)

In [59]:
df

       미국    한국  중국
년도
2000  2.1  0.40  10
2010  2.2  0.40  13
2020  2.3  0.45  15

In [ ]:
# 데이터를 복제해서 원하는 값 찾기

In [ ]:
#미국은 놔두고 한국,중국 데이터만 가져오고 싶을 때

In [60]:
df2 = df[["중국","한국"]].copy() #데이터 프레임이기 때문에 대괄호 두개!

In [61]:
df2

      중국    한국
년도
2000  10  0.40
2010  13  0.40
2020  15  0.45

In [63]:
df2.columns = ["브라질","아르헨티나"]

In [64]:
df2 # 메모리의 또 다른 공간에 새로 복제하기 때문에 원본인 df는 바뀌지 않음!

      브라질  아르헨티나
년도
2000   10   0.40
2010   13   0.40
2020   15   0.45

In [65]:
df

       미국    한국  중국
년도
2000  2.1  0.40  10
2010  2.2  0.40  13
2020  2.3  0.45  15